cases/cylinder/example/0/fluid/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type            uniformFixedValue;
        uniformValue    table
        (           
            (0          (0 0 0.44))
            (2.4999     (0 0 0.44))
            (2.5        (0 0 0))
        );
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi.liquid;
        value           uniform (0 0 0);
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    wall
    {
        type            noSlip;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
