cases/cylinder/example/0/fluid/k.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      k.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1e-05;

boundaryField
{
    bottom
    {
        type            kqRWallFunction;
        value           uniform 1e-05;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-05;
        value           uniform 1e-05;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 1e-05;
    }
    fluid_to_solid
    {
        type            kqRWallFunction;
        value           uniform 1e-05;
    }
}


// ************************************************************************* //
